Rails_projects/blogger/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "jellyfish-4477548_1920.jpg"], ["image_updated_at", "2020-07-13 11:12:08.987507"], ["updated_at", "2020-07-13 11:12:09.009171"], ["id", 10]]