Rails_projects/blogger/app/models/article.rb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "tag2"], ["LIMIT", 1]]
---
  def tag_list=(tags_string)
    tag_names = tags_string.split(",").collect{|s| s.strip.downcase}.uniq
    new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }